# 第一章 数据类型 
print ('''第0课 print()与变量
 一、语法篇
 第一章 数据类型
 第0课 print()与变量
 第1课 字符串、整数、浮点数
 第3课 input()函数
 第4课 列表、字典、元组''')

print('let\'s go')
print ("let's go")

# 在print内部使用三引号'''（连续输入三个单引号）来实现自动换行。/我们可以在需要换行的地方后面都加上转义字符中的换行符号\n。
# 要让计算机学会区分第二个单引号，我们需要用到转义字符\。

name='千寻'
name='小千'
print(name)

# 我们可以将变量当作一个盒子，你可以在这个盒子里放任何内容，这个“盒子”在Python中被称为【变量】，你可以在这个“盒子”里放任何你想放的内容。
# 而这个往盒子里装东西的过程，在代码的魔法世界被称为【赋值】。变量之所以称为变量，是因为它保存的数据是可以随意变化的。
# 第一行代码：【name='千寻'】表达的意思是：把千寻这个名字放到name这个变量“盒子”中。
# 由于，计算机是一行行自上而下执行代码的，所以当运行到第二行代码【name='小千'】时，变量“name”里存储的【'千寻'】就被替换成了【'小千'】。
# 所以，当运行到第三行print(name)时，我们打印出的结果，就自然而然的是小千了。

# !!!要注意的规则是：在代码世界中，赋值符号=不是左边等于右边的意思。仅仅表示赋值动作：把右边的内容放到了左边的盒子中。
# !!!代表左右两边相等的符号，是比较运算符==，虽然他俩长得像，但代表的却是完全不同的意思，可千万不要搞混了。


print ("""へ　　　　　／|
　　/＼7　　　 ∠＿/
　 /　│　　 ／　／
　│　Z ＿,＜　／　　 /`ヽ
　│　　　　　ヽ　　 /　　〉
　 Y　　　　　`　 /　　/
　ｲ●　､　●　　⊂⊃〈　　/
　()　 へ　　　　|　＼〈
　　>ｰ ､_　 ィ　 │ ／／
　 / へ　　 /　ﾉ＜| ＼＼
　 ヽ_ﾉ　　(_／　 │／／
　　7　　　　　　　|／
　　＞―r￣￣`ｰ―＿""")

# 学霸笔记: https://www.yuque.com/wangruoxuan-lx8yt/gg4q7o/gvf9si
